In [2]:
import pandas as pd
import mysql.connector

In [23]:
df_attacks = pd.read_csv('attacks_limpieza_completa.csv', index_col=0)
df_attacks.head(2)

,year,type,country,age,species_,fecha_limpia,fatal,sex,latitud,longitud,...,fatal_N,fatal_Unknown,fatal_Y,fatal_N.1,fatal_Unknown.1,fatal_Y.1,species_.1,fecha_limpia.1,type.1,age_NORM
0,2018,Boating,usa,57.0,White shark,Jun,N,F,39.78373,-100.445882,...,1,0,0,1,0,0,4,7,1,9.116327
1,2018,Unprovoked,usa,11.0,Unespecific,Jun,N,F,39.78373,-100.445882,...,1,0,0,1,0,0,3,7,7,3.804860

In [24]:
df_attacks = pd.read_csv('attacks_limpieza_completa.csv', index_col=0)
df_attacks.head(2)

,year,type,country,age,species_,fecha_limpia,fatal,sex,latitud,longitud,...,fatal_N,fatal_Unknown,fatal_Y,fatal_N.1,fatal_Unknown.1,fatal_Y.1,species_.1,fecha_limpia.1,type.1,age_NORM
0,2018,Boating,usa,57.0,White shark,Jun,N,F,39.78373,-100.445882,...,1,0,0,1,0,0,4,7,1,9.116327
1,2018,Unprovoked,usa,11.0,Unespecific,Jun,N,F,39.78373,-100.445882,...,1,0,0,1,0,0,3,7,7,3.804860

In [25]:
df_clima = pd.read_csv('datos_clima_limpio.csv', index_col=0)
df_clima.head(2)

,rh_950mb,rh_900mb,rh_850mb,rh_800mb,rh_750mb,rh_700mb,rh_650mb,rh_600mb,rh_550mb,rh_500mb,...,temp2m,lifted_index,rh2m,msl_pressure,prec_type,prec_amount,snow_depth,wind10m.direction,wind10m.speed,country
0,4,2,3,3,3,0,2,5,0,-3,...,20,2,5,1017,none,0,0,170,2,usa
1,4,2,3,3,3,3,4,4,0,-2,...,23,2,5,1016,none,0,0,220,2,usa

Cread la BBDD con el nombre de tiburones.

In [26]:
def crear_bbdd(nombre_bbdd):

    mydb = mysql.connector.connect(
      host="localhost",
      user="root",
      password="AlumnaAdalab" 
    )
    print("Conexión realizada con éxito")
    
    mycursor = mydb.cursor()

    try:
        mycursor.execute(f"CREATE DATABASE IF NOT EXISTS {nombre_bbdd};")
        print(mycursor)
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

- Llamamos a la función con el nombre de nuestra BBDD y observamos que se ha creado.

In [27]:
mydb = crear_bbdd("tiburones")

Conexión realizada con éxito
CMySQLCursor: CREATE DATABASE IF NOT EXISTS tiburones;

Cread las tablas de la BBDD:
- Tabla ataques
- Tabla clima

In [28]:
def crear_insertar_tabla(nombre_bbdd, contraseña, query):
    # nos conectamsos con el servidor usando el conector de sql
    cnx = mysql.connector.connect(user='root', password=f"{contraseña}",
                                     host='127.0.0.1', database=f"{nombre_bbdd}")
    # iniciamos el cursor
    mycursor = cnx.cursor()
    
    # intentamos hacer la query
    try: 
        mycursor.execute(query)
        cnx.commit() 
    # en caso de que podamos ejecutar la query devuelvenos un error para saber en que nos estamos equivocando
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [29]:
df_attacks.head(2)

,year,type,country,age,species_,fecha_limpia,fatal,sex,latitud,longitud,...,fatal_N,fatal_Unknown,fatal_Y,fatal_N.1,fatal_Unknown.1,fatal_Y.1,species_.1,fecha_limpia.1,type.1,age_NORM
0,2018,Boating,usa,57.0,White shark,Jun,N,F,39.78373,-100.445882,...,1,0,0,1,0,0,4,7,1,9.116327
1,2018,Unprovoked,usa,11.0,Unespecific,Jun,N,F,39.78373,-100.445882,...,1,0,0,1,0,0,3,7,7,3.804860

In [30]:
tabla_ataques = '''
CREATE TABLE IF NOT EXISTS `tiburones`.`ataques`(
 indice INT NOT NULL AUTO_INCREMENT,
 year INT NOT NULL,
 type VARCHAR(255) NOT NULL,
 country VARCHAR(255) NOT NULL,
 species_ VARCHAR(255) NOT NULL,
 fecha_limpia VARCHAR(255) NOT NULL,
 fatal CHAR(1) NOT NULL,
 sex CHAR(1) NOT NULL,
 latitud FLOAT NOT NULL,
 longitud FLOAT NOT NULL,
 age_NORM FLOAT NOT NULL,
 PRIMARY KEY (`indice`))
ENGINE = InnoDB;
'''

In [19]:
df_clima.columns

Index(['rh_950mb', 'rh_900mb', 'rh_850mb', 'rh_800mb', 'rh_750mb', 'rh_700mb',
       'rh_650mb', 'rh_600mb', 'rh_550mb', 'rh_500mb', 'rh_450mb', 'rh_400mb',
       'rh_350mb', 'rh_300mb', 'rh_250mb', 'rh_200mb', 'wind_950mb',
       'wind_900mb', 'wind_850mb', 'wind_800mb', 'wind_750mb', 'wind_700mb',
       'wind_650mb', 'wind_600mb', 'wind_550mb', 'wind_500mb', 'wind_450mb',
       'wind_400mb', 'wind_350mb', 'wind_300mb', 'wind_250mb', 'wind_200mb',
       'index', 'timepoint', 'cloudcover', 'highcloud', 'midcloud', 'lowcloud',
       'rh_profile', 'wind_profile', 'temp2m', 'lifted_index', 'rh2m',
       'msl_pressure', 'prec_type', 'prec_amount', 'snow_depth',
       'wind10m.direction', 'wind10m.speed', 'country'],
      dtype='object')

In [31]:
tabla_clima = '''
CREATE TABLE IF NOT EXISTS `tiburones`.`clima`(
 indice INT NOT NULL AUTO_INCREMENT,
 timepoint INT NOT NULL,
 cloudcover INT NOT NULL,
 temp2m INT NOT NULL,
 msl_pressure INT NOT NULL,
 `wind10m.direction` INT NOT NULL,
 `wind10m.speed` INT NOT NULL,
 pais VARCHAR(255) NOT NULL,
 rh_950mb INT NOT NULL,
 wind_900mb INT NOT NULL,
 PRIMARY KEY (`indice`))
ENGINE = InnoDB;
'''

- Creamos las tablas

In [32]:
crear_insertar_tabla("tiburones","AlumnaAdalab", tabla_ataques)

In [33]:
crear_insertar_tabla("tiburones","AlumnaAdalab", tabla_clima)

BONUS Insertar los datos en las tablas.
📌 Nota Esta parte del pair es optativa y no será considerada para la evaluación